# Project 1 | Notebook

##### Importing libraries

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

##### Importing data

In [2]:
df = pd.read_csv('alldata.csv')

##### Viewing data

In [3]:
df.shape

(6964, 5)

In [4]:
df.head()

,position,company,description,reviews,location
0,Development Director,ALS TDI,Development Director\nALS Therapy Development ...,NaN,"Atlanta, GA 30301"
1,An Ostentatiously-Excitable Principal Research...,The Hexagon Lavish,"Job Description\n\n""The road that leads to acc...",NaN,"Atlanta, GA"
2,Data Scientist,Xpert Staffing,"Growing company located in the Atlanta, GA are...",NaN,"Atlanta, GA"
3,Data Analyst,Operation HOPE,DEPARTMENT: Program OperationsPOSITION LOCATIO...,44.0,"Atlanta, GA 30303"
4,Assistant Professor -TT - Signal Processing & ...,Emory University,DESCRIPTION\nThe Emory University Department o...,550.0,"Atlanta, GA"

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6964 entries, 0 to 6963
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   position     6953 non-null   object
 1   company      6953 non-null   object
 2   description  6953 non-null   object
 3   reviews      5326 non-null   float64
 4   location     6953 non-null   object
dtypes: float64(1), object(4)
memory usage: 272.2+ KB

##### Cleaning and Wrangling

In [6]:
# erasing nulls in position column (logicial reasons)
df = df[df['position'].notna()]
# dropping identical job offers
df = df.drop_duplicates(keep='first')

In [7]:
# cleaning position column

# standardizing values inside of position column
df['position'] = df['position'].str.lower()
df.loc[df['position'].str.contains('analy'), 'position'] = 'data_analyst'
df.loc[df['position'].str.contains('engine'), 'position'] = 'data_engineer' 
df.loc[df['position'].str.contains('scien'), 'position'] = 'data_scientist'

# removing all irrelevant positions
df = df[(df.position == 'data_analyst')|(df.position == 'data_scientist')|(df.position == 'data_engineer')]

In [8]:
df['position'].value_counts()

data_scientist    2520
data_engineer     1315
data_analyst      1219
Name: position, dtype: int64

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5054 entries, 1 to 6963
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   position     5054 non-null   object
 1   company      5054 non-null   object
 2   description  5054 non-null   object
 3   reviews      3804 non-null   float64
 4   location     5054 non-null   object
dtypes: float64(1), object(4)
memory usage: 236.9+ KB

In [10]:
# cleaning review column

# Turn all null reviews into the number value 0 (assumption = no input for reviews = no reviews)
df['reviews'] = df['reviews'].fillna(0)
df['reviews'] = df['reviews'].astype(int)

In [11]:
df['reviews'].value_counts()

0        1250
25902     141
2         133
108       132
5         117
         ...
1674        1
1047        1
494         1
414         1
982         1
Name: reviews, Length: 526, dtype: int64

In [12]:
# cleaning location column
df['location'] = df['location'].str.replace('\d+', '', regex = True)

In [13]:
df['location'].value_counts()

New York, NY          420
Seattle, WA           385
San Francisco, CA     348
Cambridge, MA         305
Boston, MA            292
                     ...
Palisades, NY           1
Secaucus, NJ            1
Union, NJ               1
Montclair, NJ           1
New Hyde Park, NY       1
Name: location, Length: 126, dtype: int64

In [14]:
df[['city', 'state']] = df['location'].str.split(',', 1, expand=True) # splitting location into city and state (for tableau)

In [15]:
df_Q2 = df[(df.position == 'data_analyst')] # creating df to answer Q2 via Tableau

In [16]:
df_Q2['city'].value_counts()

New York                  241
Washington                134
Chicago                   128
Boston                    109
San Francisco              92
Seattle                    77
Los Angeles                68
Cambridge                  64
Atlanta                    59
San Diego                  54
Austin                     36
Mountain View              22
Sunnyvale                  20
Manhattan                  18
Boulder                    16
Redmond                    14
Redwood City                8
Oakland                     8
South San Francisco         7
San Mateo                   4
Jersey City                 3
Brooklyn                    3
Berkeley                    3
Queens                      3
Menlo Park                  3
San Bruno                   2
San Rafael                  2
Burlingame                  2
San Carlos                  1
Novato                      1
Emeryville                  1
Alameda                     1
Kentfield                   1
Belmont                     1
San Francisco Bay Area      1
Hoboken                     1
Lafayette                   1
Secaucus                    1
Murray Hill                 1
Newark                      1
Parsippany                  1
Harrison                    1
Kenilworth                  1
Rahway                      1
Lynbrook                    1
Troy Hills                  1
New Hyde Park               1
Name: city, dtype: int64

In [18]:
df_Q2.to_csv('alldata_q2.csv') # creating file used in Tableau

In [ ]:
# cleaning description column